cask_args appdir: "~/Applications", require_sha: true

brew "adr-tools"
brew "imagemagick"
brew "tmux"
brew "telnet"
brew "nvm"
brew "rg"

brew "pnpm"
brew "lazydocker"

# encrypt/decrypt kvm tools
# brew "shush"

brew "tree"
brew "watch"

tap "aws/tap"
brew "awscli"

# cask "microsoft-edge"
# cask "firefox"
# cask "squirrel"

cask "brave-browser"

cask "visual-studio-code"

cask "squidman"
cask "iterm2"

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

# For Haskell
# brew "llvm@12"
# brew "ghcup"

brew "jq"

cask_args appdir: "/Applications", require_sha: true
cask "1password"
cask "1password/tap/1password-cli"

# Dev Tools for GRPC
# tap "twilio/brew"
# brew "twilio"

# sync dotfiles
brew "yadm"

# edit
brew "neovim"

# User apps
cask_args appdir: "~/Applications", require_sha: true
cask "notion"
