
brew "adr-tools"
brew "imagemagick"
brew "tmux"
brew "telnet"
brew "rg"
brew "lazydocker"

# Front-End Deveopment Tools
brew "nvm"
brew "yarn", args: ["ignore-dependencies"]
brew "pnpm"


# encrypt/decrypt kvm tools
# brew "shush"

brew "tree"
brew "watch"

tap "aws/tap"
brew "awscli"


#:- APP installed only for user
cask_args appdir: "~/Applications", require_sha: true
# cask "squirrel"
cask "brave-browser"
cask "visual-studio-code"
cask "squidman"
cask "iterm2"

#:- APPs installed for all user
cask_args appdir: "/Applications", require_sha: true
cask "microsoft-edge"
cask "firefox"
cask "1password"
cask "1password/tap/1password-cli"
# tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "chromedriver"

cask_args appdir: "/Applications", require_sha: true
# cask "google-chrome"

# Virtual machines
cask "utm"

# For Haskell
# brew "llvm@12"
# brew "ghcup"

# For Rust
brew "llvm"
brew "jq"
brew "yq"


tap "twilio/brew"
brew "twilio"

brew "pyenv"
brew "python3"

# Database 
brew "sqlite3"
brew "postgresql@15"
cask_args appdir: "/Applications", require_sha: true
tap "redis-stack/redis-stack"
cask "redis-stack"

brew "gh"

# sync dotfiles
brew "yadm"

# edit
brew "neovim"

# User apps
cask_args appdir: "~/Applications", require_sha: true
# keycastr -- a keystorke visualizer
cask "keycastr"
cask "divvy"

# Python
brew "pipenv"

brew "httpie"

brew "gawk"

# GPG
brew "gnupg"

# DevOps Kits
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "helm"
brew "ansible"

# 3D print
cask_args appdir: "/Applications", require_sha: true
cask "bambu-studio"

# Note Taking
cask_args appdir: "/Applications", require_sha: true
cask "anytype"

# Network tools
cask_args appdir: "/Applications", require_sha: true
cask "wireshark"

# Vedio Editor
cask_args appdir: "/Applications", require_sha: true
cask "insta360-studio"

# RN
# iOS
brew "ruby"
brew "swiftformat"
brew "ios-deploy"
brew "watchman"

# Android
cask "zulu@17"

