
brew "adr-tools"
brew "imagemagick"
brew "tmux"
brew "telnet"
brew "nvm"
brew "rg"

brew "pnpm"
brew "lazydocker"

# encrypt/decrypt kvm tools
# brew "shush"

brew "tree"
brew "watch"

tap "aws/tap"
brew "awscli"


#:- APP installed only for user
cask_args appdir: "~/Applications", require_sha: true
# cask "squirrel"
cask "brave-browser"
cask "visual-studio-code"
cask "squidman"
cask "iterm2"

#:- APPs installed for all user
cask_args appdir: "/Applications", require_sha: true
cask "microsoft-edge"
cask "firefox"
cask "1password"
cask "1password/tap/1password-cli"
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

# For Haskell
# brew "llvm@12"
# brew "ghcup"

brew "jq"

# Dev Tools for GRPC
# tap "twilio/brew"
# brew "twilio"

tap "twilio/brew"
brew "twilio"

brew "pyenv"
brew "python3"

tap "adoptopenjdk/openjdk"
cask "adoptopenjdk8"
brew "postgresql@14"
brew "maven@3.9"

brew "gh"

# sync dotfiles
brew "yadm"

# edit
brew "neovim"

# User apps
cask_args appdir: "~/Applications", require_sha: true
# keycastr -- a keystorke visualizer
cask "keycastr"

# Python
brew "pipenv"

brew "httpie"
